Revit 2026 API

# BuiltInFailuresInaccurateFailures Class

---

Failures about Inaccurate.

SystemObject Autodesk.Revit.DBBuiltInFailuresInaccurateFailures

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static class InaccurateFailures
```
```vb
Public NotInheritable Class InaccurateFailures
```
```cpp
public ref class InaccurateFailures abstract sealed
```
```fsharp
[<AbstractClassAttribute>]
[<SealedAttribute>]
type InaccurateFailures = class end
```

The BuiltInFailuresInaccurateFailures type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | InaccurateAreaLine | Area separation line is slightly off axis and may cause inaccuracies. |
|  | InaccurateBeamOrBrace | Beam or Brace is slightly off axis and may cause inaccuracies. |
|  | InaccurateCurveBasedFamily | Curve-Based Family is slightly off axis and may cause inaccuracies. |
|  | InaccurateDriveCurve | Element is slightly off axis and may cause inaccuracies. |
|  | InaccurateGrid | Grid is slightly off axis and may cause inaccuracies. |
|  | InaccurateLevel | Level is slightly off axis and may cause inaccuracies. |
|  | InaccurateLine | Line is slightly off axis and may cause inaccuracies. |
|  | InaccurateMassingSketchLine | Line in Massing Sketch is slightly off axis and may cause inaccuracies. |
|  | InaccurateRefPlane | Ref Plane is slightly off axis and may cause inaccuracies. |
|  | InaccurateRoomSeparation | Room separation line is slightly off axis and may cause inaccuracies. |
|  | InaccurateSketchLine | Line in Sketch is slightly off axis and may cause inaccuracies. |
|  | InaccurateSpaceSeparation | Space separation line is slightly off axis and may cause inaccuracies. |
|  | InaccurateWall | Wall is slightly off axis and may cause inaccuracies. |

#### Reference

Autodesk.Revit.DB Namespace